{"pages":[{"title":"Projects","text":"Gomoku AI Agent 2021.09-2021.12 Final Project for Artificial Intelligence Reinforcement Learning Conversation Recommender System with Knowledge Graph Fusion 2021.03-2021.06 Final Project for Social Network Mining Natural Language Processing College Interpersonal Relationship 2020.03-2020.06 Final Project for Research Methods for Social Sciences User Study Qing’shan Natural Reserve Trail Experience Design 2021.01-2021.02 2021 China Eco Design Award Experience Design CoLearner Virtual Study Room 2020.03-2020.06 Final Project for Human-Computer Interaction Product Design","link":"/projects/index.html"},{"title":"About Me","text":"I am looking for available internships/RA positions in 2022. Feel free to contact! Email: irreelz@hotmail.com or zhaoqy@fudan.edu.cn Skills: Programming: Python, MATLAB, R, C, HTML/CSS, JavaScript Framework: Pytorch, Spark, Shell, D3, Bootstrap Design: Photoshop, Illustration, Premiere, Sketch, Figma Honors:TBU Language: Chinese (Native) &amp; English (Fluent) Coursework: Human-Computer Interaction Introduction to Artificial Intelligence Data Visualization Psychology Statistics Convex Optimization Creative Design Thinking Statistics I, II Introduction to Computer System Data Structure GeorgiaTech Introduction to User Experience Design (Grade: 98.82%) University of California San Diego Design Principles: an Introduction (Audit) University of California San Diego User Experience: Research &amp; Prototyping (Audit) Some fun facts about me: TBU","link":"/about/index.html"}],"posts":[{"title":"Conversatonal Recommender Systems via Knowledge Graph based Semantic Fusion","text":"2021.03-2021.06 Final Project for Social Network Mining Background: In order to solving problems like cold start and accessibility in traditional recommender systems, the project aims to implement a Chatbot which could recommend items to users via conversational interaction. Implementation: We regenerated code in reference*. I was responsible for language generation module (Transformer) in the project and improved its generated language quality compared with the original one. Code: Feel free to contact me.","link":"/2021/06/01/crsf/"},{"title":"CoLearner Virtual Study Room","text":"2020.03-2020.06 Final Project for Human-Computer Interaction I am responsible for time management and contribute to ideation, user research (Contextual inquiry), prototype and user study (Usability testing, heuristic evaluation and cognive walkthrough) in the project. Abstract: Starting from a broad question How online teaching affects students’ learning experience, we conduct a user research to find Problems students meet during online learning and why. Through contextual inquiry, we identified three major problems. To narrow down our focus, we selected Low-efficiency as our interesting problem space to dig further and understand its chains of causality. To solve the problem, we propose a virtual study room APP after our brainstorming and idea critics. Then we design different fidelity protoype and storyboards. At last, evaluate our design via several usability testing including heuristic evaluation, cognitive walkthrough. Report and prototype are not public.","link":"/2020/06/18/colearner/"},{"title":"Qing&#39;shan Natural Reserve Trail Experience Design","text":"2021.01-2021.02 Teamwork Our goal is to design a new trail in Qing’shan Village with better user experience and little influence on nature. The project won 2021 China Eco Design Award. Thanks to my teammates and WellDesign Studio🥰 Love u guys!!! Details are not public for future landing.","link":"/2021/02/01/qingshan/"},{"title":"Gomoku AI Agent","text":"2021.09-2021.12 Final Project for Artificial Intelligence Background: The goal is to implement an artificial intelligence agent playing Gomoku (Five in a Row) as good as possible. The game is simulated based on Python Piskvork Gomoku Manager for Gomocup AI Tournament. Implementation: Use three different algorithms as follows. Minimax with Alpha-Beta Pruning Monte Carlo Tree Search Reinforcement Learning (Specifically, two shallow neural network for evaluation and action prediction respectively and was trained with self-teaching.) Code: Feel free to contact me.","link":"/2021/12/18/gomoku/"},{"title":"Fast Computation of SimRank Enhanced by Semantics on HIN","text":"2021.12-2022.01 Final Project for Graph Data Mining Abstract: The project focuses on the technique of computing SimRank scores on heterogeneous information networks and propose a novel computation framework for HINs. The proposed linear equation has good features to enable Conjugate Gradient Iterative method and its variants to speed up the computation. The project implements the new computation algorithm and experimental results on different datasets solidates its efficiency.","link":"/2022/01/18/simrank-hin/"}],"tags":[{"name":"Project","slug":"Project","link":"/tags/Project/"},{"name":"NLP","slug":"NLP","link":"/tags/NLP/"},{"name":"Design","slug":"Design","link":"/tags/Design/"},{"name":"HCI","slug":"HCI","link":"/tags/HCI/"},{"name":"RL","slug":"RL","link":"/tags/RL/"},{"name":"Coursework","slug":"Coursework","link":"/tags/Coursework/"},{"name":"Graph","slug":"Graph","link":"/tags/Graph/"},{"name":"User Study","slug":"User-Study","link":"/tags/User-Study/"}],"categories":[]}